Revit 2024 API
CreateRelatedFileProgressChangedEventArgs Members
The CreateRelatedFileProgressChangedEventArgs type exposes the following members.
Methods
Name | Description
Dispose |  (Inherited from RevitAPIEventArgs.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsCancelled
 Indicates whether the event is being cancelled.
 (Inherited from RevitAPIEventArgs.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Cancellable
 Indicates whether an event may be cancelled by an event delegate.
 (Inherited from RevitAPIEventArgs.)
CreatingCloudSharedLocal
 Indicates if it is creating cloud shared local model.
DownloadFinished
 Indicates if all data downloads are finished.
FinishedSize
 The transferred data size, in bytes, since the last time this event was raised.
 (Inherited from DataTransferProgressChangedEventArgs.)
FullDownload
 Indicates if download the full data of the document, which will take longer than subsequent downloads.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from RevitAPIEventArgs.)
Location
 Full path of the central model which is to be operated.
 (Inherited from WorksharedOperationProgressChangedEventArgs.)
Speed
 Speed(bytes/second) in this event.
 (Inherited from DataTransferProgressChangedEventArgs.)
Status
 Gets API event status, reflect current operation execution status.
 (Inherited from WorksharedOperationProgressChangedEventArgs.)
TotalSize
 Total expected data size to transfer, in bytes.
 (Inherited from DataTransferProgressChangedEventArgs.)
TransferMode
 Data transfer mode in this event.
 (Inherited from DataTransferProgressChangedEventArgs.)
See Also
CreateRelatedFileProgressChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace